In [1]:
!wget https://raw.githubusercontent.com/adeshpande3/Pandas-Tutorial/master/RegularSeasonCompactResults.csv

--2021-05-13 00:28:05--  https://raw.githubusercontent.com/adeshpande3/Pandas-Tutorial/master/RegularSeasonCompactResults.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 4115852 (3.9M) [text/plain]
Saving to: ‘RegularSeasonCompactResults.csv’

RegularSeasonCompac 100%[===================>]   3.92M  21.6MB/s    in 0.2s

2021-05-13 00:28:06 (21.6 MB/s) - ‘RegularSeasonCompactResults.csv’ saved [4115852/4115852]

In [2]:
!ls -al

total 4036
drwxr-xr-x 1 root root    4096 May 13 00:28 .
drwxr-xr-x 1 root root    4096 May 13 00:26 ..
drwxr-xr-x 4 root root    4096 May  6 13:43 .config
-rw-r--r-- 1 root root 4115852 May 13 00:28 RegularSeasonCompactResults.csv
drwxr-xr-x 1 root root    4096 May  6 13:44 sample_data

In [3]:
!wc RegularSeasonCompactResults.csv

 145290  145290 4115852 RegularSeasonCompactResults.csv

In [4]:
!head RegularSeasonCompactResults.csv

Season,Daynum,Wteam,Wscore,Lteam,Lscore,Wloc,Numot
1985,20,1228,81,1328,64,N,0
1985,25,1106,77,1354,70,H,0
1985,25,1112,63,1223,56,H,0
1985,25,1165,70,1432,54,H,0
1985,25,1192,86,1447,74,H,0
1985,25,1218,79,1337,78,H,0
1985,25,1228,64,1226,44,N,0
1985,25,1242,58,1268,56,N,0
1985,25,1260,98,1133,80,H,0

In [5]:
import pandas as pd

df = pd.read_csv("RegularSeasonCompactResults.csv")

In [6]:
df

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0         1985      20   1228      81   1328      64    N      0
1         1985      25   1106      77   1354      70    H      0
2         1985      25   1112      63   1223      56    H      0
3         1985      25   1165      70   1432      54    H      0
4         1985      25   1192      86   1447      74    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

[145289 rows x 8 columns]

In [7]:
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [8]:
df.tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [9]:
print(df.shape)

(145289, 8)

In [ ]:
(123456, 8)

(123456, 256, 256)
(123456, 124, 124, 3)
(123456,  48, 48, 3, 10)

In [10]:
print(df.index)

RangeIndex(start=0, stop=145289, step=1)

In [ ]:
for i in range(0, 145289, 1):

In [11]:
print(df.columns.tolist())

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [ ]:
1985,20,1228,81.21,,64,N,0

In [12]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145289 entries, 0 to 145288
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Season  145289 non-null  int64
 1   Daynum  145289 non-null  int64
 2   Wteam   145289 non-null  int64
 3   Wscore  145289 non-null  int64
 4   Lteam   145289 non-null  int64
 5   Lscore  145289 non-null  int64
 6   Wloc    145289 non-null  object
 7   Numot   145289 non-null  int64
dtypes: int64(7), object(1)
memory usage: 8.9+ MB
None

In [13]:
df.describe()

              Season         Daynum  ...         Lscore          Numot
count  145289.000000  145289.000000  ...  145289.000000  145289.000000
mean     2001.574834      75.223816  ...      64.497009       0.044387
std         9.233342      33.287418  ...      11.380625       0.247819
min      1985.000000       0.000000  ...      20.000000       0.000000
25%      1994.000000      47.000000  ...      57.000000       0.000000
50%      2002.000000      78.000000  ...      64.000000       0.000000
75%      2010.000000     103.000000  ...      72.000000       0.000000
max      2016.000000     132.000000  ...     150.000000       6.000000

[8 rows x 7 columns]

In [14]:
df.max()

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

In [15]:
df.min()

Season    1985
Daynum       0
Wteam     1101
Wscore      34
Lteam     1101
Lscore      20
Wloc         A
Numot        0
dtype: object

In [16]:
df.mean()

Season    2001.574834
Daynum      75.223816
Wteam     1286.720646
Wscore      76.600321
Lteam     1282.864064
Lscore      64.497009
Numot        0.044387
dtype: float64

# Series

In [17]:
df.Wteam

0         1228
1         1106
2         1112
3         1165
4         1192
          ...
145284    1114
145285    1163
145286    1246
145287    1277
145288    1386
Name: Wteam, Length: 145289, dtype: int64

In [18]:
df.Wteam.max()

1464

In [19]:
df.Wteam.min()

1101

In [20]:
df.Wteam.mean()

1286.7206464357246

In [21]:
df['Wteam']

0         1228
1         1106
2         1112
3         1165
4         1192
          ...
145284    1114
145285    1163
145286    1246
145287    1277
145288    1386
Name: Wteam, Length: 145289, dtype: int64

In [22]:
print(type(df.Wteam))
print(type(df['Wteam']))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [ ]:
df.Wteam
df['Wteam']

In [23]:
df[82:85]

    Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
82    1985      28   1464      71   1134      58    H      0
83    1985      29   1116      59   1416      45    N      0
84    1985      29   1124      99   1341      77    H      0

In [24]:
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [25]:
df[0:5]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [26]:
df[2:5]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [27]:
df[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0

In [28]:
df[145289-3:]

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [29]:
df[-3:]

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [30]:
l = [ 0, 1, 2, 3, 4]
print(l[-3:])

[2, 3, 4]

In [31]:
df[:]

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0         1985      20   1228      81   1328      64    N      0
1         1985      25   1106      77   1354      70    H      0
2         1985      25   1112      63   1223      56    H      0
3         1985      25   1165      70   1432      54    H      0
4         1985      25   1192      86   1447      74    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

[145289 rows x 8 columns]

In [ ]:
df = pd.read_csv("RegularSeasonCompactResults.csv")

In [32]:
result = pd.read_csv("RegularSeasonCompactResults.csv")

In [ ]:
df1 = pd.read_csv("RegularSeasonCompactResults.csv")
df2 = pd.read_csv("RegularSeasonCompactResults.csv")

In [33]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145289 entries, 0 to 145288
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Season  145289 non-null  int64
 1   Daynum  145289 non-null  int64
 2   Wteam   145289 non-null  int64
 3   Wscore  145289 non-null  int64
 4   Lteam   145289 non-null  int64
 5   Lscore  145289 non-null  int64
 6   Wloc    145289 non-null  object
 7   Numot   145289 non-null  int64
dtypes: int64(7), object(1)
memory usage: 8.9+ MB

In [34]:
sub_df = df[1000:]

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145289 entries, 0 to 145288
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Season  145289 non-null  int64
 1   Daynum  145289 non-null  int64
 2   Wteam   145289 non-null  int64
 3   Wscore  145289 non-null  int64
 4   Lteam   145289 non-null  int64
 5   Lscore  145289 non-null  int64
 6   Wloc    145289 non-null  object
 7   Numot   145289 non-null  int64
dtypes: int64(7), object(1)
memory usage: 8.9+ MB

In [44]:
df

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0         1985      20   1228      81   1328      64    N      0
1         1985      25   1106      77   1354      70    H      0
2         1985      25   1112      63   1223      56    H      0
3         1985      25   1165      70   1432      54    H      0
4         1985      25   1192      86   1447      74    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

[145289 rows x 8 columns]

In [35]:
sub_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144289 entries, 1000 to 145288
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Season  144289 non-null  int64
 1   Daynum  144289 non-null  int64
 2   Wteam   144289 non-null  int64
 3   Wscore  144289 non-null  int64
 4   Lteam   144289 non-null  int64
 5   Lscore  144289 non-null  int64
 6   Wloc    144289 non-null  object
 7   Numot   144289 non-null  int64
dtypes: int64(7), object(1)
memory usage: 8.8+ MB

In [45]:
df2 = df[82:83]

In [38]:
df.loc[82]

Season    1985
Daynum      28
Wteam     1464
Wscore      71
Lteam     1134
Lscore      58
Wloc         H
Numot        0
Name: 82, dtype: object

In [47]:
print(type(df[82:83]))
print(type(df.loc[82]['Wteam']))

<class 'pandas.core.frame.DataFrame'>
<class 'numpy.int64'>

In [ ]:
df.Wteam             # 특정 column. 결과는 Series
df[82:85]            # 특정 row. 결과는 DataFrame
df[82]['Wteam']      # ERROR
df[82][2]            # ERROR
df.loc[82]['Wteam']  # <--- 제대로된 사용 방법
df.iloc[82][2]       # <--- 제대로된 사용 방법

In [48]:
df.loc[82]

Season    1985
Daynum      28
Wteam     1464
Wscore      71
Lteam     1134
Lscore      58
Wloc         H
Numot        0
Name: 82, dtype: object

In [51]:
df.loc[82]['Wteam']

1464

In [54]:
 l = [
      [ 0, 1, 2 ],
      [ 3, 4, 5 ],
      [ 6, 7, 8 ],
      [ 9, 10, 11 ]
 ]

In [55]:
l[2][1]

7

In [ ]:
l[2,1] # ERROR

In [57]:
df.loc[82,'Wteam']

1464

In [58]:
df.iloc[82,2]

1464

In [ ]:
df.loc[82]['Wteam']
df.loc[82,'Wteam']
df.iloc[82][2]
df.iloc[82,2]

In [60]:
df.Wteam[82]

1464

In [63]:
df.loc[82:85]

    Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
82    1985      28   1464      71   1134      58    H      0
83    1985      29   1116      59   1416      45    N      0
84    1985      29   1124      99   1341      77    H      0
85    1985      29   1130      86   1306      63    A      0

In [64]:
df.loc[ [ 0, 3, 5] ]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
3    1985      25   1165      70   1432      54    H      0
5    1985      25   1218      79   1337      78    H      0

In [65]:
df.loc[ [0, 3] ]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
3    1985      25   1165      70   1432      54    H      0

In [69]:
df.loc[ [ 2,3,4] ]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [72]:
df.loc[ 2:5 ]
# TODO : confirm

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0
5    1985      25   1218      79   1337      78    H      0

In [ ]:
df.loc[ [ 2,3,4 ] ]
df.loc[ [ 2:5 ] ]

In [ ]:
df.loc[ 0, 3 ] # ERROR

In [67]:
df.iloc[ 0, 3 ]

81

In [68]:
df.loc[82][2]

1464

In [ ]:
df.Wteam

df[ 3:5 ]

df.loc[3, 'Wteam']

df.iloc[3, 2]

In [74]:
df.iloc[:4,:2]

   Season  Daynum
0    1985      20
1    1985      25
2    1985      25
3    1985      25

In [95]:
df.iloc[82][:2]

Season    1985
Daynum      28
Name: 82, dtype: object

In [79]:
df2[:2]

    Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
82    1985      28   1464      71   1134      58    H      0

In [96]:
df[ [3,4,6,7] ]
df[ 6:8 ]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
6    1985      25   1228      64   1226      44    N      0
7    1985      25   1242      58   1268      56    N      0

In [ ]:
s = "1\n21\n321\n4321\n54321\n"
for i in ranage(5):
  for i in range...:
    print(...)

  print(s)

In [97]:
s = "1\n21\n321\n4321\n54321\n"
print(s)

1
21
321
4321
54321

In [ ]:
print("hi")
print("hello")
print("halo")

print("hi\nhello\nhalo\n")

# 검색

In [109]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

mask = pd.Series( [True, False, True, False] )
print(mask)
print()

df.loc[mask, 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

0     True
1    False
2     True
3    False
dtype: bool

   AAA  BBB  CCC
0    4   -1  100
1    5   20   50
2    6   -1  -30
3    7   40  -50

In [112]:
import numpy as np

df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

index = np.array( [ 0, 2] )
print(index)

df.loc[index, 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

[0, 2]
   AAA  BBB  CCC
0    4   -1  100
1    5   20   50
2    6   -1  -30
3    7   40  -50

In [111]:
index = np.array( [ 0, 2] )
print(index)
print(len(index))
print(index.shape)
print(index[0])

[0 2]
2
(2,)
0

In [116]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

filtered_mask = df.AAA>=5
print(filtered_mask)
print()

df.loc[filtered_mask, 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

0    False
1     True
2     True
3     True
Name: AAA, dtype: bool

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

In [115]:
l = [ 4, 5, 6, 7 ]
m = []
for i in l:
  m.append(i>=5)
print(m)

[False, True, True, True]

In [117]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

# filtered_mask = df.AAA>=5
# df.loc[filtered_mask, 'BBB'] = -1

df.loc[df.AAA>=5, 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

In [124]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()


df.loc[df.AAA%2==0, 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   -1  100
1    5   20   50
2    6   -1  -30
3    7   40  -50

In [120]:
a = 2
a%2==0

l = [ 0, 1, 2, 3, 4 ]

l%2==0

TypeError: ignored

In [129]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

filtered_mask = (df.AAA>=5) & (df.BBB<40)
print(filtered_mask)
print()

df.loc[filtered_mask, 'BBB'] = -1
# df.loc[(df.AAA>=5) & (df.BBB<40), 'BBB'] = -1

print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

0    False
1     True
2     True
3    False
dtype: bool

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   40  -50

In [128]:
a = pd.Series([ True, False, True, False])
b = pd.Series([ True, True,  True,  True])

# print(a and B)  # ERROR
print(a & b)
print(a | b)

0     True
1    False
2     True
3    False
dtype: bool
0    True
1    True
2    True
3    True
dtype: bool

In [131]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

# [ 1, 2, 3 ] 과 [ 0, 1, 2 ]의 교집합
# filtered_index = np.array( [ 1, 2 ] )
filtered_index = np.where( (df.AAA>=5) & (df.BBB<40) )[0]

df.loc[filtered_index, 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   40  -50

In [132]:
filtered_index = np.where( (df.AAA>=5) & (df.BBB<40) )
print(filtered_index)

(array([1, 2]),)

In [136]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

new_df = df[ ["AAA", "BBB"] ]
print(new_df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB
0    4   10
1    5   20
2    6   30
3    7   40

In [138]:
print(df.AAA)
print(type(df.AAA))

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64
<class 'pandas.core.series.Series'>

In [141]:
print(df["AAA"])
print(type(df["AAA"]))

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64
<class 'pandas.core.series.Series'>

In [144]:
print(df[ ["AAA"] ])
print(type(df[ ["AAA"] ]))

   AAA
0    4
1    5
2    6
3    7
<class 'pandas.core.frame.DataFrame'>

In [147]:
print(df[ ["AAA", "BBB", "CCC", "AAA", "BBB"] ])
df.AAA = -1
print(df)

   AAA  BBB  CCC  AAA  BBB
0    4   10  100    4   10
1    5   20   50    5   20
2    6   30  -30    6   30
3    7   40  -50    7   40
   AAA  BBB  CCC
0   -1   10  100
1   -1   20   50
2   -1   30  -30
3   -1   40  -50

In [148]:
print(df[1:3])

   AAA  BBB  CCC
1   -1   20   50
2   -1   30  -30

In [150]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

# df.loc[df.AAA>=5, "BBB" ] = -1
df.loc[df.AAA>=5, ["BBB", "CCC"] ] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   10  100
1    5   -1   -1
2    6   -1   -1
3    7   -1   -1

In [151]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()


# AAA>=5,   BBB =  999
# AAA< 5,   BBB = -999

df.loc[df.AAA>=5, 'BBB'] = 999
df.loc[df.AAA<5, 'BBB'] = -999

print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4 -999  100
1    5  999   50
2    6  999  -30
3    7  999  -50

In [156]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()


# AAA>=5,   BBB =  999
# AAA< 5,   BBB = -999

df.BBB = np.where(df.AAA>=5, 999, -999)
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4 -999  100
1    5  999   50
2    6  999  -30
3    7  999  -50

In [ ]:
   AAA  BBB  CCC
0    4 -999  100
1    5  999   50
2    6  999  -30
3    7  999  -50

In [155]:
a = 6
if a>5:
  a = 3
if a<=5:
  a= -3
print(a)

a = 6
if a>5:
  a = 3
else:
  a = -3
print(a)

-3
3

In [160]:
l = [ 0, 1, 2, 3, 4 ]
print(2 in l)
print(5 in l)

names = [ "tom", "jerry", "bob", "brute"]
print("tom" in names)

True
False
True

In [166]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

print(df.AAA<=5)
print(df.AAA.isin( [5, 6] ))

df.loc[df.AAA.isin([3,5]), 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

0     True
1     True
2    False
3    False
Name: AAA, dtype: bool
0    False
1     True
2     True
3    False
Name: AAA, dtype: bool
   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   30  -30
3    7   40  -50

In [167]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

df.loc[df.index.isin([0, 3, 5]), 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   -1  100
1    5   20   50
2    6   30  -30
3    7   -1  -50

In [169]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

# df.loc[df.AAA%2==0, 'BBB'] = -1
df.loc[df.index%2==0, 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   -1  100
1    5   20   50
2    6   -1  -30
3    7   40  -50

In [170]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

df.loc[(df.AAA+df.BBB)%2==0, 'BBB'] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   -1  100
1    5   20   50
2    6   -1  -30
3    7   40  -50

In [171]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

df.CCC = df.BBB
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC
0    4   10   10
1    5   20   20
2    6   30   30
3    7   40   40

In [175]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

df.CCC = df.AAA%2==0
print(df)

df.loc[df.CCC, "BBB"] = -1
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB    CCC
0    4   10   True
1    5   20  False
2    6   30   True
3    7   40  False
   AAA  BBB    CCC
0    4   -1   True
1    5   20  False
2    6   -1   True
3    7   40  False

In [181]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

df["AAA_bak"] = df.AAA
print(df)

df["AAA_bak"] = df["AAA"]
print(df)

# df.BBB_bak = df.BBB # ERROR
# print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC  AAA_bak
0    4   10  100        4
1    5   20   50        5
2    6   30  -30        6
3    7   40  -50        7
   AAA  BBB  CCC  AAA_bak
0    4   10  100        4
1    5   20   50        5
2    6   30  -30        6
3    7   40  -50        7

In [178]:
d = {}
d["tom"] = 30
print(d)

{'tom': 30}

In [186]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

# df[ "AAA2" ] = df[ "AAA" ]
# df[ "BBB2" ] = df[ "BBB" ]
# df[ "CCC2" ] = df[ "CCC" ]
df[ ["AAA2", "BBB2", "CCC2"] ] = df[ ["AAA", "BBB", "CCC"] ]
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC  AAA2  BBB2  CCC2
0    4   10  100     4    10   100
1    5   20   50     5    20    50
2    6   30  -30     6    30   -30
3    7   40  -50     7    40   -50

In [197]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

source_column_names = [ name for name in df.columns ]
new_column_names = [ name+"2" for name in source_column_names ]
print(source_column_names)
print(new_column_names)

# source_column_names = [ "AAA", "BBB", "CCC" ]
# new_column_names = [ "AAA2", "BBB2", "CCC2" ]
df[new_column_names] = df[source_column_names]
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

['AAA', 'BBB', 'CCC']
['AAA2', 'BBB2', 'CCC2']
   AAA  BBB  CCC  AAA2  BBB2  CCC2
0    4   10  100     4    10   100
1    5   20   50     5    20    50
2    6   30  -30     6    30   -30
3    7   40  -50     7    40   -50

In [212]:
df = pd.DataFrame(
        {"AAA": ["tom", "jerry", "tom", "bob"], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

def encode(AAA):
  if AAA=="tom": return 0
  if AAA=="jerry": return 1
  if AAA=="bob": return 2
  return -1

df["AAA_encoded"] = df[["AAA"]].applymap(encode)
print(df)

     AAA  BBB  CCC
0    tom   10  100
1  jerry   20   50
2    tom   30  -30
3    bob   40  -50

     AAA  BBB  CCC  AAA_encoded
0    tom   10  100            0
1  jerry   20   50            1
2    tom   30  -30            0
3    bob   40  -50            2

In [211]:
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

# AAA_encoded : ~3 : 1, 4~5 : 2, 6~ : 3
def encode(AAA):
  if AAA<=3 : return 1
  if 4<=AAA and AAA<=5 : return 2
  if 6<=AAA : return 3
  return -1

df["AAA_encoded"] = df[["AAA"]].applymap(encode)
print(df)

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

   AAA  BBB  CCC  AAA_encoded
0    4   10  100            2
1    5   20   50            2
2    6   30  -30            3
3    7   40  -50            3

In [ ]:
AAA = "tom"
BBB = 3
CCC = 100

def encode(AAA):
  if AAA<=3 : return 1
  if 4<=AAA and AAA<=5 : return 2
  if 6<=AAA : return 3
  return -1

AAA_encoded = encode(AAA)

# AAA, BBB, CCC, AAA_encoded


save(AAA_encoded, CCC)

In [222]:
df = pd.DataFrame(
        {"AAA": [6, 5, 4, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

# sorted_index = df.AAA.argsort()
# print(sorted_index)

# print(df.loc[sorted_index])


print(df.loc[df.AAA.argsort()])
# print(df.loc[pd.Series([2,1,0,3])])
# print(df.loc[[2,1,0,3]])

   AAA  BBB  CCC
0    6   10  100
1    5   20   50
2    4   30  -30
3    7   40  -50

   AAA  BBB  CCC
2    4   30  -30
1    5   20   50
0    6   10  100
3    7   40  -50

In [227]:
df = pd.DataFrame(
        {"AAA": [-6, -5, 4, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()

print(df.AAA.abs())
print()

sorted_index = df.AAA.abs().argsort()
print(sorted_index)

print(df.loc[sorted_index])

   AAA  BBB  CCC
0   -6   10  100
1   -5   20   50
2    4   30  -30
3    7   40  -50

0    6
1    5
2    4
3    7
Name: AAA, dtype: int64

0    2
1    1
2    0
3    3
Name: AAA, dtype: int64
   AAA  BBB  CCC
2    4   30  -30
1   -5   20   50
0   -6   10  100
3    7   40  -50

```
6, 5, 4, 7  ->  4, 5, 6, 7
-6, -5, 4, 7 -> 4, 5, 6, 7

빼기 -> 절대값 -> 소팅
6, 5, 4, 7 ->  0.9, -0.1, -1.1, 1.9 -> 0.9, 0.1, 1.1, 1.9 -> 0.1, 1.1, 0.9, 1.9


```

In [231]:
df = pd.DataFrame(
        {"AAA": [6, 5, 4, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

print(df)
print()
print((df.AAA - 5.1))
print((df.AAA - 5.1).abs())
print((df.AAA - 5.1).abs().argsort())
print(df.loc[ (df.AAA - 5.1).abs().argsort() ])

   AAA  BBB  CCC
0    6   10  100
1    5   20   50
2    4   30  -30
3    7   40  -50

0    0.9
1   -0.1
2   -1.1
3    1.9
Name: AAA, dtype: float64
0    0.9
1    0.1
2    1.1
3    1.9
Name: AAA, dtype: float64
0    1
1    0
2    2
3    3
Name: AAA, dtype: int64
   AAA  BBB  CCC
1    5   20   50
0    6   10  100
2    4   30  -30
3    7   40  -50

In [242]:
from numpy import nan as NAN

df = pd.DataFrame([[NAN, 2, NAN, 0],
                   [3, 4, NAN, 1],
                   [NAN, NAN, NAN, 5],
                   [NAN, 3, NAN, 4]],
                  columns=list('ABCD'))

# df = pd.DataFrame([[NAN, 2, NAN, 0],
#                    [3, 4, NAN, 1],
#                    [NAN, NAN, NAN, 5],
#                    [NAN, 3, NAN, 4]],
#                   columns=['A', 'B', 'C', 'D'])
print(df, "\n")

print(df.isnull(), "\n")

print(df.isnull().any(), "\n")

print(df.isnull().any().any(), "\n")

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False
3   True  False  True  False

A     True
B     True
C     True
D    False
dtype: bool

True

In [ ]:
l = [1,,2]

In [238]:
s = "ABCD"
print(s[0])
print(s[1:3])
l = list(s)
print(l)

A
BC
['A', 'B', 'C', 'D']

In [244]:
from numpy import nan as NAN

df = pd.DataFrame([[NAN, 2, NAN, 0],
                   [3, 4, NAN, 1],
                   [NAN, NAN, NAN, 5],
                   [NAN, 3, NAN, 4]],
                  columns=list('ABCD'))

# df = pd.DataFrame([[NAN, 2, NAN, 0],
#                    [3, 4, NAN, 1],
#                    [NAN, NAN, NAN, 5],
#                    [NAN, 3, NAN, 4]],
#                   columns=['A', 'B', 'C', 'D'])
print(df, "\n")

print(df.isnull(), "\n")
print(df.isnull().sum(), "\n")
print(df.isnull().sum().sum(), "\n")

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False
3   True  False  True  False

A    3
B    1
C    4
D    0
dtype: int64

8

In [248]:
from numpy import nan as NAN

df = pd.DataFrame([[NAN, 2, NAN, 0],
                   [3, 4, NAN, 1],
                   [NAN, NAN, NAN, 5],
                   [NAN, 3, NAN, 4]],
                  columns=list('ABCD'))

print(len(df))

# print(df.isnull(), "\n")
print(df.isnull().sum()/len(df)*100, "\n")

4
A     75.0
B     25.0
C    100.0
D      0.0
dtype: float64

In [254]:
from numpy import nan as NAN

df = pd.DataFrame([[1, 2, 2, 0],
                   [3, 4, 3, 1],
                   [NAN, NAN, NAN, 5],
                   [1, 3, 3, 4]],
                  columns=list('ABCD'))


# print(df.dropna(axis=0), "\n")
print(df.dropna(), "\n")

     A    B    C  D
0  1.0  2.0  2.0  0
1  3.0  4.0  3.0  1
3  1.0  3.0  3.0  4

In [253]:
from numpy import nan as NAN

df = pd.DataFrame([[1, NAN, 2, 0],
                   [3, NAN, 3, 1],
                   [2, NAN, 3, 5],
                   [1, 3, 3, 4]],
                  columns=list('ABCD'))


print(df.dropna(axis=1), "\n")

   A  C  D
0  1  2  0
1  3  3  1
2  2  3  5
3  1  3  4